Revit 2027 API
DuctSettings.RectangularDuctSizeSuffix Property
 The rectangular duct size suffix string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RectangularDuctSizeSuffix { get; set; }
Public Property RectangularDuctSizeSuffix As String
	Get
	Set
public:
property String^ RectangularDuctSizeSuffix {
	String^ get ();
	void set (String^ value);
}
member RectangularDuctSizeSuffix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace